Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C123/TM4C123BH6PGE.svd
        <register>
          <name>PPACMP</name>
          <description>Analog Comparator Peripheral Present</description>
          <addressOffset>0x0000033C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPACMP_P0</name>
              <description>Analog Comparator Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPPWM</name>
          <description>Pulse Width Modulator Peripheral Present</description>
          <addressOffset>0x00000340</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPPWM_P0</name>
              <description>PWM Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPPWM_P1</name>
              <description>PWM Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPQEI</name>
          <description>Quadrature Encoder Interface Peripheral Present</description>
          <addressOffset>0x00000344</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPQEI_P0</name>
              <description>QEI Module 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPQEI_P1</name>
              <description>QEI Module 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPEEPROM</name>
          <description>EEPROM Peripheral Present</description>
          <addressOffset>0x00000358</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPEEPROM_P0</name>
              <description>EEPROM Module Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PPWTIMER</name>
          <description>32/64-Bit Wide General-Purpose Timer Peripheral Present</description>
          <addressOffset>0x0000035C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PPWTIMER_P0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Present</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Present</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Present</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Present</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Present</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PPWTIMER_P5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Present</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWD</name>
          <description>Watchdog Timer Software Reset</description>
          <addressOffset>0x00000500</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRWD_R0</name>
              <description>Watchdog Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWD_R1</name>
              <description>Watchdog Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRTIMER</name>
          <description>16/32-Bit General-Purpose Timer Software Reset</description>
          <addressOffset>0x00000504</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRGPIO</name>
          <description>General-Purpose Input/Output Software Reset</description>
          <addressOffset>0x00000508</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRGPIO_R0</name>
              <description>GPIO Port A Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R1</name>
              <description>GPIO Port B Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R2</name>
              <description>GPIO Port C Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R3</name>
              <description>GPIO Port D Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R4</name>
              <description>GPIO Port E Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R5</name>
              <description>GPIO Port F Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R6</name>
              <description>GPIO Port G Software Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R7</name>
              <description>GPIO Port H Software Reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R8</name>
              <description>GPIO Port J Software Reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R9</name>
              <description>GPIO Port K Software Reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R10</name>
              <description>GPIO Port L Software Reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R11</name>
              <description>GPIO Port M Software Reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R12</name>
              <description>GPIO Port N Software Reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRGPIO_R13</name>
              <description>GPIO Port P Software Reset</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDMA</name>
          <description>Micro Direct Memory Access Software Reset</description>
          <addressOffset>0x0000050C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRDMA_R0</name>
              <description>uDMA Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRHIB</name>
          <description>Hibernation Software Reset</description>
          <addressOffset>0x00000514</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRHIB_R0</name>
              <description>Hibernation Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Software Reset</description>
          <addressOffset>0x00000518</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRUART_R0</name>
              <description>UART Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R1</name>
              <description>UART Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R2</name>
              <description>UART Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R3</name>
              <description>UART Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R4</name>
              <description>UART Module 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R5</name>
              <description>UART Module 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R6</name>
              <description>UART Module 6 Software Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRUART_R7</name>
              <description>UART Module 7 Software Reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRSSI</name>
          <description>Synchronous Serial Interface Software Reset</description>
          <addressOffset>0x0000051C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRSSI_R0</name>
              <description>SSI Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R1</name>
              <description>SSI Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R2</name>
              <description>SSI Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRSSI_R3</name>
              <description>SSI Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRI2C</name>
          <description>Inter-Integrated Circuit Software Reset</description>
          <addressOffset>0x00000520</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRI2C_R0</name>
              <description>I2C Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R1</name>
              <description>I2C Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R2</name>
              <description>I2C Module 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R3</name>
              <description>I2C Module 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R4</name>
              <description>I2C Module 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRI2C_R5</name>
              <description>I2C Module 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCAN</name>
          <description>Controller Area Network Software Reset</description>
          <addressOffset>0x00000534</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRCAN_R0</name>
              <description>CAN Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRCAN_R1</name>
              <description>CAN Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRADC</name>
          <description>Analog-to-Digital Converter Software Reset</description>
          <addressOffset>0x00000538</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRADC_R0</name>
              <description>ADC Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRADC_R1</name>
              <description>ADC Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRACMP</name>
          <description>Analog Comparator Software Reset</description>
          <addressOffset>0x0000053C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRACMP_R0</name>
              <description>Analog Comparator Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRPWM</name>
          <description>Pulse Width Modulator Software Reset</description>
          <addressOffset>0x00000540</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRPWM_R0</name>
              <description>PWM Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRPWM_R1</name>
              <description>PWM Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRQEI</name>
          <description>Quadrature Encoder Interface Software Reset</description>
          <addressOffset>0x00000544</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRQEI_R0</name>
              <description>QEI Module 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRQEI_R1</name>
              <description>QEI Module 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SREEPROM</name>
          <description>EEPROM Software Reset</description>
          <addressOffset>0x00000558</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SREEPROM_R0</name>
              <description>EEPROM Module Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRWTIMER</name>
          <description>32/64-Bit Wide General-Purpose Timer Software Reset</description>
          <addressOffset>0x0000055C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_SRWTIMER_R0</name>
              <description>32/64-Bit Wide General-Purpose Timer 0 Software Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R1</name>
              <description>32/64-Bit Wide General-Purpose Timer 1 Software Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R2</name>
              <description>32/64-Bit Wide General-Purpose Timer 2 Software Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R3</name>
              <description>32/64-Bit Wide General-Purpose Timer 3 Software Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R4</name>
              <description>32/64-Bit Wide General-Purpose Timer 4 Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_SRWTIMER_R5</name>
              <description>32/64-Bit Wide General-Purpose Timer 5 Software Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCWD</name>
          <description>Watchdog Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000600</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCWD_R0</name>
              <description>Watchdog Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCWD_R1</name>
              <description>Watchdog Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCGCTIMER</name>
          <description>16/32-Bit General-Purpose Timer Run Mode Clock Gating Control</description>
          <addressOffset>0x00000604</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RCGCTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Run Mode Clock Gating Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Run Mode Clock Gating Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Run Mode Clock Gating Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Run Mode Clock Gating Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Run Mode Clock Gating Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RCGCTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Run Mode Clock Gating Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
